{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "nb_row": 5, "b_constraint": null, "input_dtype": "float32", "nb_col": 5, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "nb_filter": 24, "bias": true, "dim_ordering": "tf", "border_mode": "valid", "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 36, "nb_col": 5, "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "bias": true, "dim_ordering": "tf", "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 48, "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "bias": true, "dim_ordering": "tf", "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "bias": true, "dim_ordering": "tf", "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_5", "b_regularizer": null, "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "nb_row": 3, "bias": true, "dim_ordering": "tf", "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 100, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 50, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 10, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "name": "dense_4", "b_regularizer": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 1, "activation": "linear", "trainable": true}}], "keras_version": "1.1.2"}