{"config": [{"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "nb_filter": 24, "input_dtype": "float32", "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_1", "W_regularizer": null, "border_mode": "valid", "trainable": true, "nb_row": 5, "batch_input_shape": [null, 160, 320, 3], "nb_col": 5, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "nb_filter": 36, "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "name": "convolution2d_2", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "border_mode": "valid", "trainable": true, "nb_row": 5, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "nb_filter": 48, "subsample": [2, 2], "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_3", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "border_mode": "valid", "trainable": true, "nb_row": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "nb_filter": 64, "subsample": [2, 2], "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_4", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "border_mode": "valid", "trainable": true, "nb_row": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "nb_filter": 64, "subsample": [2, 2], "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_5", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "border_mode": "valid", "trainable": true, "nb_row": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 1000, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "dense_1", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 500, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "dense_2", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 100, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "dense_3", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 50, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "dense_4", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 10, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "dense_5", "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_10", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 1, "b_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "name": "dense_6", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}