{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "input_dtype": "float32", "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [2, 2], "border_mode": "valid", "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_1", "activation": "linear", "nb_filter": 24, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_col": 5, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "nb_filter": 36, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_col": 5, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "nb_filter": 48, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "nb_filter": 64, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "nb_filter": 64, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "b_constraint": null, "output_dim": 100, "activation": "linear", "bias": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "b_constraint": null, "output_dim": 50, "activation": "linear", "bias": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "name": "dense_3", "b_constraint": null, "output_dim": 10, "activation": "linear", "bias": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "name": "dense_4", "b_constraint": null, "output_dim": 1, "activation": "linear", "bias": true, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}]}