{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear", "nb_filter": 24, "W_regularizer": null, "nb_row": 5, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "bias": true, "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "border_mode": "valid", "nb_filter": 36}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "bias": true, "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_3", "b_constraint": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "border_mode": "valid", "nb_filter": 48}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "bias": true, "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_4", "b_constraint": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "border_mode": "valid", "nb_filter": 64}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "bias": true, "W_constraint": null, "subsample": [2, 2], "name": "convolution2d_5", "b_constraint": null, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "border_mode": "valid", "nb_filter": 64}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "name": "dense_1", "b_constraint": null, "output_dim": 100, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "name": "dense_2", "b_constraint": null, "output_dim": 50, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "name": "dense_3", "b_constraint": null, "output_dim": 10, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "name": "dense_4", "b_constraint": null, "output_dim": 1, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null}}], "keras_version": "1.1.2"}