{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "border_mode": "valid", "b_constraint": null, "batch_input_shape": [null, 160, 320, 3], "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 24, "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "nb_row": 5, "W_regularizer": null, "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "border_mode": "valid", "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 36, "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "border_mode": "valid", "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 48, "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "border_mode": "valid", "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "input_dim": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 100}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_constraint": null, "input_dim": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 50}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_constraint": null, "input_dim": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 10}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_constraint": null, "input_dim": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1}}]}