{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 24, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "input_dtype": "float32", "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 36, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 48, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "name": "convolution2d_4", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "name": "convolution2d_5", "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "trainable": true, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "output_dim": 100, "bias": true, "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"input_dim": null, "trainable": true, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "output_dim": 50, "bias": true, "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"input_dim": null, "trainable": true, "init": "glorot_uniform", "name": "dense_3", "b_regularizer": null, "output_dim": 10, "bias": true, "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"input_dim": null, "trainable": true, "init": "glorot_uniform", "name": "dense_4", "b_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}}]}