{"config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "batch_input_shape": [null, 160, 320, 3], "bias": true, "nb_col": 5, "nb_row": 5, "input_dtype": "float32", "activity_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1", "W_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 36, "bias": true, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 48, "bias": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 64, "bias": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_4", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 64, "bias": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_5", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1000, "name": "dense_1", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 500, "name": "dense_2", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 100, "name": "dense_3", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 50, "name": "dense_4", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "name": "dense_5", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "name": "dense_6", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear"}}], "class_name": "Sequential", "keras_version": "1.1.2"}