{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "nb_filter": 24, "input_dtype": "float32", "trainable": true, "name": "convolution2d_1", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activation": "linear", "nb_col": 5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "nb_row": 5, "nb_filter": 36, "nb_col": 5, "trainable": true, "name": "convolution2d_2", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "nb_row": 3, "nb_filter": 48, "nb_col": 3, "trainable": true, "name": "convolution2d_3", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "nb_row": 3, "nb_filter": 64, "nb_col": 3, "trainable": true, "name": "convolution2d_4", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "nb_row": 3, "nb_filter": 64, "nb_col": 3, "trainable": true, "name": "convolution2d_5", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "output_dim": 1000, "trainable": true, "name": "dense_1", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "output_dim": 500, "trainable": true, "name": "dense_2", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "output_dim": 100, "trainable": true, "name": "dense_3", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "output_dim": 50, "trainable": true, "name": "dense_4", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "output_dim": 10, "trainable": true, "name": "dense_5", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "output_dim": 1, "trainable": true, "name": "dense_6", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "activation": "linear"}}]}