{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "init": "glorot_uniform", "input_dtype": "float32", "nb_row": 5, "trainable": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "nb_filter": 24, "subsample": [2, 2], "nb_col": 5, "dim_ordering": "tf", "bias": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "init": "glorot_uniform", "nb_row": 5, "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "subsample": [2, 2], "nb_col": 5, "bias": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "init": "glorot_uniform", "nb_row": 3, "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "subsample": [2, 2], "nb_col": 3, "bias": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "init": "glorot_uniform", "nb_row": 3, "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "subsample": [2, 2], "nb_col": 3, "bias": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "init": "glorot_uniform", "nb_row": 3, "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "subsample": [2, 2], "nb_col": 3, "bias": true, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 1000, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 500, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 100, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 50, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 10, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_6", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 1, "input_dim": null, "bias": true}}], "keras_version": "1.1.2"}