{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "subsample": [2, 2], "bias": true, "dim_ordering": "tf", "nb_filter": 24, "init": "glorot_uniform", "name": "convolution2d_1", "trainable": true, "W_regularizer": null, "nb_col": 5, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "dim_ordering": "tf", "nb_filter": 36, "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "nb_col": 5, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "dim_ordering": "tf", "nb_filter": 48, "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "nb_col": 5, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "name": "convolution2d_4", "trainable": true, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "name": "convolution2d_5", "trainable": true, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_1", "trainable": true, "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_2", "trainable": true, "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_3", "trainable": true, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_4", "trainable": true, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "input_dim": null, "W_regularizer": null}}]}