{"config": [{"config": {"b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "bias": true, "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "nb_row": 5, "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "nb_filter": 24, "subsample": [2, 2], "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "name": "convolution2d_1", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 5, "nb_filter": 36, "subsample": [2, 2], "b_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "name": "convolution2d_2", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 3, "nb_filter": 48, "subsample": [2, 2], "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_3", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 3, "nb_filter": 64, "subsample": [2, 2], "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_4", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_row": 3, "nb_filter": 64, "subsample": [2, 2], "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "name": "convolution2d_5", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 1000, "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_1", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 100, "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_2", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 50, "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_3", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 10, "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_4", "input_dim": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 1, "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_5", "input_dim": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}