{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 24, "name": "convolution2d_1", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 36, "name": "convolution2d_2", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 48, "name": "convolution2d_3", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 64, "name": "convolution2d_4", "init": "glorot_uniform", "nb_row": 3, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 64, "name": "convolution2d_5", "init": "glorot_uniform", "nb_row": 3, "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_3", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}, {"class_name": "Dense", "config": {"input_dim": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "name": "dense_4", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "trainable": true, "b_constraint": null}}]}