{"keras_version": "1.1.2", "config": [{"config": {"input_dtype": "float32", "activation": "linear", "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "b_regularizer": null, "b_constraint": null, "nb_row": 5, "bias": true, "name": "convolution2d_1", "border_mode": "valid", "W_regularizer": null, "nb_filter": 24, "subsample": [2, 2], "trainable": true, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 5, "bias": true, "name": "convolution2d_2", "border_mode": "valid", "W_regularizer": null, "nb_filter": 36, "subsample": [2, 2], "trainable": true, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_3", "border_mode": "valid", "W_regularizer": null, "nb_filter": 48, "subsample": [2, 2], "trainable": true, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_4", "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "subsample": [2, 2], "trainable": true, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "bias": true, "name": "convolution2d_5", "border_mode": "valid", "W_regularizer": null, "nb_filter": 64, "subsample": [2, 2], "trainable": true, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "b_constraint": null, "bias": true, "input_dim": null, "W_regularizer": null, "name": "dense_1", "trainable": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "b_constraint": null, "bias": true, "input_dim": null, "W_regularizer": null, "name": "dense_2", "trainable": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "b_constraint": null, "bias": true, "input_dim": null, "W_regularizer": null, "name": "dense_3", "trainable": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "b_constraint": null, "bias": true, "input_dim": null, "W_regularizer": null, "name": "dense_4", "trainable": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}