{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "nb_filter": 24, "W_constraint": null, "name": "convolution2d_1", "input_dtype": "float32", "bias": true, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "nb_col": 5, "activation": "linear", "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_filter": 36, "W_constraint": null, "name": "convolution2d_2", "bias": true, "border_mode": "valid", "subsample": [2, 2], "activation": "linear", "trainable": true, "W_regularizer": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_filter": 48, "W_constraint": null, "name": "convolution2d_3", "bias": true, "border_mode": "valid", "subsample": [2, 2], "activation": "linear", "trainable": true, "W_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_4", "bias": true, "border_mode": "valid", "subsample": [2, 2], "activation": "linear", "trainable": true, "W_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_5", "bias": true, "border_mode": "valid", "subsample": [2, 2], "activation": "linear", "trainable": true, "W_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "output_dim": 1000, "W_constraint": null, "name": "dense_1", "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "output_dim": 500, "W_constraint": null, "name": "dense_2", "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "output_dim": 100, "W_constraint": null, "name": "dense_3", "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "output_dim": 50, "W_constraint": null, "name": "dense_4", "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "output_dim": 10, "W_constraint": null, "name": "dense_5", "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "output_dim": 1, "W_constraint": null, "name": "dense_6", "bias": true, "activation": "linear", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "input_dim": null}}]}