{"config": [{"config": {"name": "convolution2d_1", "b_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "trainable": true, "nb_col": 5, "nb_filter": 24, "nb_row": 5, "batch_input_shape": [null, 160, 320, 3], "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_2", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "nb_filter": 36, "nb_row": 5, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 48, "nb_row": 3, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "convolution2d_4", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 64, "nb_row": 3, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "convolution2d_5", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 64, "nb_row": 3, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "border_mode": "valid", "W_constraint": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "output_dim": 1000, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_2", "output_dim": 500, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_3", "output_dim": 100, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_8", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_4", "output_dim": 50, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_9", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_5", "output_dim": 10, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_10", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "dense_6", "output_dim": 1, "trainable": true, "W_regularizer": null, "b_regularizer": null, "input_dim": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}