{"config": [{"config": {"trainable": true, "input_dtype": "float32", "border_mode": "valid", "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "nb_filter": 24, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"trainable": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "W_constraint": null, "nb_filter": 36, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"trainable": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "W_constraint": null, "nb_filter": 48, "activity_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"trainable": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"trainable": true, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 100, "input_dim": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 50, "input_dim": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 10, "input_dim": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1, "input_dim": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}