{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "input_dtype": "float32", "activity_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "b_constraint": null, "nb_filter": 24, "nb_row": 5, "name": "convolution2d_1", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "b_constraint": null, "nb_filter": 36, "nb_row": 5, "name": "convolution2d_2", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "nb_filter": 48, "nb_row": 3, "name": "convolution2d_3", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_4", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_5", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "bias": true, "b_constraint": null, "W_regularizer": null, "name": "dense_1", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "bias": true, "b_constraint": null, "W_regularizer": null, "name": "dense_2", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "bias": true, "b_constraint": null, "W_regularizer": null, "name": "dense_3", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "W_regularizer": null, "name": "dense_4", "W_constraint": null}}], "keras_version": "1.1.2"}