{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 3], "nb_filter": 24, "subsample": [2, 2], "b_constraint": null, "trainable": true, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "b_regularizer": null, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 36, "subsample": [2, 2], "W_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 48, "subsample": [2, 2], "W_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 64, "subsample": [2, 2], "W_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "output_dim": 100, "bias": true, "input_dim": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "output_dim": 50, "bias": true, "input_dim": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "output_dim": 10, "bias": true, "input_dim": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_3"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "output_dim": 1, "bias": true, "input_dim": null, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_4"}}], "keras_version": "1.1.2"}