{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "nb_row": 5, "input_dtype": "float32", "b_constraint": null, "nb_filter": 24, "bias": true, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 5, "b_regularizer": null, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "nb_row": 5, "bias": true, "b_constraint": null, "nb_filter": 36, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "nb_row": 3, "bias": true, "b_constraint": null, "nb_filter": 48, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_4", "nb_row": 3, "bias": true, "b_constraint": null, "nb_filter": 64, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1", "output_dim": 100, "b_constraint": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2", "output_dim": 50, "b_constraint": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_3", "output_dim": 10, "b_constraint": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_4", "output_dim": 1, "b_constraint": null, "W_constraint": null}}], "keras_version": "1.1.2"}