{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "input_dtype": "float32", "name": "convolution2d_1", "nb_filter": 24, "W_regularizer": null, "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "trainable": true, "subsample": [2, 2], "W_constraint": null, "nb_row": 5, "batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "name": "convolution2d_2", "nb_filter": 36, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "bias": true, "nb_row": 5, "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "bias": true, "nb_row": 3, "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "nb_col": 3, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "bias": true, "nb_row": 3, "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "nb_col": 3, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "bias": true, "nb_row": 3, "activity_regularizer": null, "trainable": true, "subsample": [2, 2], "activation": "linear", "init": "glorot_uniform", "nb_col": 3, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1000, "name": "dense_1", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 500, "name": "dense_2", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "name": "dense_3", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "name": "dense_4", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "name": "dense_5", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "name": "dense_6", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null}}]}