{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "b_regularizer": null, "activation": "linear", "input_dtype": "float32", "nb_row": 5, "activity_regularizer": null, "nb_filter": 24, "border_mode": "valid", "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 5, "activity_regularizer": null, "nb_filter": 36, "border_mode": "valid", "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "activity_regularizer": null, "nb_filter": 48, "border_mode": "valid", "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "activity_regularizer": null, "nb_filter": 64, "border_mode": "valid", "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "activity_regularizer": null, "nb_filter": 64, "border_mode": "valid", "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "output_dim": 100, "bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "output_dim": 50, "bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "W_constraint": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "output_dim": 10, "bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "W_constraint": null, "b_constraint": null, "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "output_dim": 1, "bias": true, "trainable": true}}]}