{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "nb_col": 5, "name": "convolution2d_1", "activation": "linear", "nb_filter": 24, "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "input_dtype": "float32", "bias": true, "border_mode": "valid", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "name": "convolution2d_2", "nb_col": 5, "activation": "linear", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "name": "convolution2d_3", "nb_col": 5, "activation": "linear", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "name": "convolution2d_4", "nb_col": 3, "activation": "linear", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "name": "convolution2d_5", "nb_col": 3, "activation": "linear", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 100, "W_constraint": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 50, "W_constraint": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "tanh", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 10, "W_constraint": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "activation": "tanh", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 1, "W_constraint": null, "b_constraint": null, "b_regularizer": null}}], "keras_version": "1.1.2"}