{"config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "input_dtype": "float32", "init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "nb_filter": 24, "activation": "linear", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "nb_filter": 36, "activation": "linear", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_row": 5, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null, "nb_filter": 48, "activation": "linear", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_row": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null, "nb_filter": 64, "activation": "linear", "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_row": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 100, "W_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 50, "W_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform", "output_dim": 10, "W_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_4", "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": null, "b_constraint": null}}], "class_name": "Sequential", "keras_version": "1.1.2"}