{"keras_version": "1.1.2", "config": [{"config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "activation": "linear", "nb_filter": 24, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "bias": true, "init": "glorot_uniform", "nb_col": 5, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "activation": "linear", "nb_filter": 36, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "activation": "linear", "nb_filter": 48, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "activation": "linear", "nb_filter": 64, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "convolution2d_5", "border_mode": "valid", "activation": "linear", "nb_filter": 64, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_1", "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 1000, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_2", "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 500, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_3", "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 100, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_4", "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 50, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "name": "dense_5", "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 10, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_6", "activation": "linear", "trainable": true, "b_constraint": null, "input_dim": null, "output_dim": 1, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}