{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "input_dtype": "float32", "bias": true, "nb_col": 5, "name": "convolution2d_1", "trainable": true, "nb_filter": 24, "batch_input_shape": [null, 160, 320, 3], "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_col": 5, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_2", "trainable": true, "nb_filter": 36, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_3", "trainable": true, "nb_filter": 48, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "convolution2d_4", "trainable": true, "nb_filter": 64, "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_1", "trainable": true, "output_dim": 100, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_2", "trainable": true, "output_dim": 50, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_6"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_3", "trainable": true, "output_dim": 10, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_7"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "name": "dense_4", "trainable": true, "output_dim": 1, "b_regularizer": null, "activation": "linear"}}], "keras_version": "1.1.2"}