{"keras_version": "1.1.2", "config": [{"config": {"subsample": [2, 2], "nb_col": 5, "batch_input_shape": [null, 160, 320, 3], "trainable": true, "W_constraint": null, "nb_filter": 24, "input_dtype": "float32", "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_row": 5, "b_regularizer": null, "name": "convolution2d_1", "dim_ordering": "tf", "init": "glorot_uniform", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "nb_col": 5, "W_constraint": null, "trainable": true, "nb_filter": 36, "border_mode": "valid", "nb_row": 5, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "dim_ordering": "tf", "init": "glorot_uniform", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 48, "border_mode": "valid", "nb_row": 3, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "dim_ordering": "tf", "init": "glorot_uniform", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 64, "border_mode": "valid", "nb_row": 3, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "dim_ordering": "tf", "init": "glorot_uniform", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"subsample": [2, 2], "nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 64, "border_mode": "valid", "nb_row": 3, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_5", "dim_ordering": "tf", "init": "glorot_uniform", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "input_dim": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 50, "input_dim": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 10, "input_dim": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"output_dim": 1, "input_dim": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}