{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "nb_filter": 24, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_1", "bias": true, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "b_constraint": null, "b_regularizer": null, "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "nb_filter": 36, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_2", "bias": true, "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "nb_filter": 48, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_3", "bias": true, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_4", "bias": true, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "name": "convolution2d_5", "bias": true, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_1", "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1000, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_2", "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 100, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_3", "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 50, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_4", "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 10, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_5", "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "b_constraint": null, "activation": "linear"}}]}