{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "nb_row": 5, "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "name": "convolution2d_1", "nb_filter": 24, "init": "glorot_uniform", "W_constraint": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "input_dtype": "float32", "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_row": 5, "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "name": "convolution2d_2", "nb_filter": 36, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_row": 5, "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "name": "convolution2d_3", "nb_filter": 48, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "name": "convolution2d_4", "nb_filter": 64, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [2, 2], "name": "convolution2d_5", "nb_filter": 64, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": null, "name": "dense_1", "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "name": "batchnormalization_1", "mode": 0, "trainable": true, "epsilon": 0.001}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": null, "name": "dense_2", "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "name": "batchnormalization_2", "mode": 0, "trainable": true, "epsilon": 0.001}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": null, "name": "dense_3", "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "name": "batchnormalization_3", "mode": 0, "trainable": true, "epsilon": 0.001}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": null, "name": "dense_4", "b_regularizer": null, "trainable": true}}], "keras_version": "1.1.2"}