{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 3], "bias": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32", "activation": "linear", "nb_filter": 24, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 5, "name": "convolution2d_1", "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "nb_filter": 36, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 5, "name": "convolution2d_2", "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "nb_filter": 48, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_3", "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_4", "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "name": "convolution2d_5", "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "output_dim": 100, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "output_dim": 50, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "tanh"}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "output_dim": 10, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "tanh"}}, {"class_name": "Dense", "config": {"input_dim": null, "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true, "b_constraint": null, "W_constraint": null, "output_dim": 1, "name": "dense_4"}}]}