{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "nb_filter": 24, "input_dtype": "float32", "b_constraint": null, "nb_row": 5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "nb_row": 5, "b_constraint": null, "nb_filter": 36}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "nb_col": 3, "name": "convolution2d_3", "activity_regularizer": null, "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "nb_row": 3, "b_constraint": null, "nb_filter": 48}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "nb_col": 3, "name": "convolution2d_4", "activity_regularizer": null, "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "nb_row": 3, "b_constraint": null, "nb_filter": 64}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "name": "dense_1", "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "name": "dense_2", "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "name": "dense_3", "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "name": "dense_4", "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "activity_regularizer": null, "b_constraint": null}}], "keras_version": "1.1.2"}