{"keras_version": "1.1.2", "config": [{"config": {"input_dtype": "float32", "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "nb_filter": 24, "W_constraint": null, "subsample": [2, 2], "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_col": 5, "batch_input_shape": [null, 160, 160, 3], "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "name": "convolution2d_2", "border_mode": "valid", "b_regularizer": null, "nb_filter": 36, "W_constraint": null, "subsample": [2, 2], "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "name": "convolution2d_3", "border_mode": "valid", "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "subsample": [2, 2], "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "name": "convolution2d_4", "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "subsample": [2, 2], "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "name": "convolution2d_5", "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "subsample": [2, 2], "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "output_dim": 100, "activation": "linear", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "output_dim": 50, "activation": "linear", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "output_dim": 10, "activation": "linear", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dim": null, "b_regularizer": null, "output_dim": 1, "activation": "linear", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}