{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 24, "input_dtype": "float32", "name": "convolution2d_1", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "activation": "linear", "trainable": true, "nb_row": 5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 36, "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "activation": "linear", "trainable": true, "nb_row": 5}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 48, "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "activation": "linear", "trainable": true, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 64, "W_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "bias": true, "activation": "linear", "trainable": true, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "input_dim": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "axis": -1, "mode": 0, "trainable": true, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_1"}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_4", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "b_constraint": null, "trainable": true, "input_dim": null}}]}