{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_1", "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 5, "batch_input_shape": [null, 160, 320, 3], "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "input_dtype": "float32", "init": "glorot_uniform", "border_mode": "valid", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_2", "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 5, "nb_filter": 36, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_3", "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "nb_filter": 48, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_4", "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "convolution2d_5", "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "output_dim": 1000, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "output_dim": 100, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "output_dim": 50, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_4", "output_dim": 10, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_5", "output_dim": 1, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true}}], "keras_version": "1.1.2"}