{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3], "nb_filter": 24, "dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_1", "input_dtype": "float32", "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_2", "nb_col": 5, "nb_filter": 36, "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_3", "nb_col": 3, "nb_filter": 48, "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_4", "nb_col": 3, "nb_filter": 64, "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_5", "nb_col": 3, "nb_filter": 64, "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "output_dim": 1000, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "output_dim": 500, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "output_dim": 100, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_4", "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "output_dim": 50, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_5", "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "output_dim": 10, "activation": "linear", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_6", "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "W_regularizer": null, "b_constraint": null, "output_dim": 1, "activation": "linear", "b_regularizer": null}}]}