{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 24, "nb_row": 5, "name": "convolution2d_1", "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "b_regularizer": null, "bias": true, "input_dtype": "float32", "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 36, "nb_row": 5, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 48, "nb_row": 3, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_filter": 64, "nb_row": 3, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "nb_col": 3, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1000, "W_constraint": null, "name": "dense_1", "trainable": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 500, "W_constraint": null, "name": "dense_2", "trainable": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "name": "dense_3", "trainable": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_constraint": null, "name": "dense_4", "trainable": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_constraint": null, "name": "dense_5", "trainable": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "name": "dense_6", "trainable": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null}}]}