{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "init": "glorot_uniform", "batch_input_shape": [null, 160, 160, 3], "W_constraint": null, "name": "convolution2d_1", "trainable": true, "b_regularizer": null, "border_mode": "valid", "input_dtype": "float32", "activation": "linear", "W_regularizer": null, "nb_filter": 24, "dim_ordering": "tf", "nb_row": 5, "activity_regularizer": null, "nb_col": 5, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "activation": "linear", "W_regularizer": null, "nb_filter": 36, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "activation": "linear", "W_regularizer": null, "nb_filter": 48, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "activation": "linear", "W_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "activation": "linear", "W_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 100, "W_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_1", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 50, "W_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_2", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 10, "W_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_3", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_4", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}], "keras_version": "1.1.2"}