{"config": [{"config": {"nb_row": 5, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "dim_ordering": "tf", "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "convolution2d_1", "activity_regularizer": null, "nb_col": 5, "nb_filter": 24, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "subsample": [2, 2], "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_col": 5, "nb_filter": 36, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "subsample": [2, 2], "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_col": 3, "nb_filter": 48, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "subsample": [2, 2], "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "subsample": [2, 2], "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "output_dim": 1000, "name": "dense_1", "activity_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "output_dim": 500, "name": "dense_2", "activity_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "output_dim": 100, "name": "dense_3", "activity_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "output_dim": 50, "name": "dense_4", "activity_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "output_dim": 10, "name": "dense_5", "activity_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_10"}, "class_name": "ELU"}, {"config": {"trainable": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "name": "dense_6", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "W_constraint": null, "bias": true}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}