{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_1", "bias": true, "activation": "linear", "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "W_constraint": null, "border_mode": "valid", "nb_filter": 24, "b_constraint": null, "b_regularizer": null, "input_dtype": "float32", "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 36, "bias": true, "activation": "linear", "name": "convolution2d_2", "nb_row": 5, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 48, "bias": true, "activation": "linear", "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 64, "bias": true, "activation": "linear", "name": "convolution2d_4", "nb_row": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_filter": 64, "bias": true, "activation": "linear", "name": "convolution2d_5", "nb_row": 3, "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 50, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 10, "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "trainable": true}}], "keras_version": "1.1.2"}