{"config": [{"config": {"dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "bias": true, "nb_filter": 24, "trainable": true, "nb_col": 5, "nb_row": 5, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_2", "bias": true, "nb_filter": 36, "trainable": true, "nb_col": 5, "nb_row": 5, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_3", "bias": true, "nb_filter": 48, "trainable": true, "nb_col": 3, "nb_row": 3, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_4", "bias": true, "nb_filter": 64, "trainable": true, "nb_col": 3, "nb_row": 3, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_5", "bias": true, "nb_filter": 64, "trainable": true, "nb_col": 3, "nb_row": 3, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "W_regularizer": null, "b_constraint": null, "input_dim": null, "name": "dense_1", "bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "W_regularizer": null, "b_constraint": null, "input_dim": null, "name": "dense_2", "bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "W_regularizer": null, "b_constraint": null, "input_dim": null, "name": "dense_3", "bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "W_regularizer": null, "b_constraint": null, "input_dim": null, "name": "dense_4", "bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}