{"keras_version": "1.1.2", "config": [{"config": {"dim_ordering": "tf", "b_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "trainable": true, "activation": "linear", "nb_row": 5, "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 24, "b_constraint": null, "bias": true, "W_constraint": null, "input_dtype": "float32", "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_row": 5, "activity_regularizer": null, "nb_col": 5, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 36, "b_constraint": null, "bias": true, "W_constraint": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 48, "b_constraint": null, "bias": true, "W_constraint": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "activation": "linear", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 64, "b_constraint": null, "bias": true, "W_constraint": null, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "output_dim": 100, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "input_dim": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 50, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "input_dim": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 10, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "input_dim": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "output_dim": 1, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "input_dim": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}