{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "input_dtype": "float32", "bias": true, "W_regularizer": null, "name": "convolution2d_1", "nb_row": 5, "nb_filter": 24, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_constraint": null, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "nb_filter": 36, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_constraint": null, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_regularizer": null, "name": "convolution2d_3", "nb_row": 3, "nb_filter": 48, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [2, 2], "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [2, 2], "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_regularizer": null, "name": "convolution2d_5", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [2, 2], "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1000, "bias": true, "W_regularizer": null, "name": "dense_1", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 500, "bias": true, "W_regularizer": null, "name": "dense_2", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "bias": true, "W_regularizer": null, "name": "dense_3", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "bias": true, "W_regularizer": null, "name": "dense_4", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "bias": true, "W_regularizer": null, "name": "dense_5", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "bias": true, "W_regularizer": null, "name": "dense_6", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "trainable": true}}]}