{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "input_dtype": "float32", "trainable": true, "W_regularizer": null, "bias": true, "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_col": 5, "subsample": [2, 2], "nb_filter": 24, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "subsample": [2, 2], "nb_filter": 36, "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_3", "nb_col": 3, "subsample": [2, 2], "nb_filter": 48, "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "subsample": [2, 2], "nb_filter": 64, "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "subsample": [2, 2], "nb_filter": 64, "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "output_dim": 1000, "activation": "linear", "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "output_dim": 500, "activation": "linear", "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "output_dim": 100, "activation": "linear", "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "output_dim": 50, "activation": "linear", "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "bias": true, "output_dim": 10, "activation": "linear", "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_5", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "output_dim": 1, "activation": "linear", "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_6", "init": "glorot_uniform", "W_constraint": null}}]}