{"config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "nb_filter": 24, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "nb_row": 5, "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "b_constraint": null, "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_1", "W_regularizer": null, "activation": "linear", "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "nb_filter": 36, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_row": 5, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "nb_filter": 48, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_row": 3, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_row": 3, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_4", "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "nb_row": 3, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_5", "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1000, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 500, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 100, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 50, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 10, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_5", "W_regularizer": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "activation": "linear", "bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_6", "W_regularizer": null, "b_constraint": null}}], "keras_version": "1.1.2", "class_name": "Sequential"}