{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "b_constraint": null, "bias": true, "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "W_regularizer": null, "activation": "linear", "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 24, "name": "convolution2d_1", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "subsample": [2, 2], "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "nb_row": 5, "trainable": true, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_2", "nb_col": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "subsample": [2, 2], "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "nb_row": 3, "trainable": true, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_3", "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "subsample": [2, 2], "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "nb_row": 3, "trainable": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_4", "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "border_mode": "valid", "subsample": [2, 2], "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "nb_row": 3, "trainable": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "name": "convolution2d_5", "nb_col": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 1000, "trainable": true, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "name": "dense_1"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 500, "trainable": true, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "name": "dense_2"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 100, "trainable": true, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "name": "dense_3"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 50, "trainable": true, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "name": "dense_4"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 10, "trainable": true, "b_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "b_constraint": null, "name": "dense_5"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "output_dim": 1, "trainable": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "dense_6"}}]}