{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [2, 2], "trainable": true, "b_regularizer": null, "bias": true, "W_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "nb_filter": 24, "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "subsample": [2, 2], "activation": "linear", "b_constraint": null, "trainable": true, "nb_filter": 36, "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "nb_row": 3, "name": "convolution2d_3", "subsample": [2, 2], "activation": "linear", "b_constraint": null, "trainable": true, "nb_filter": 48, "W_constraint": null, "init": "glorot_uniform", "nb_col": 3, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "subsample": [2, 2], "activation": "linear", "b_constraint": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "init": "glorot_uniform", "nb_col": 3, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "nb_row": 3, "name": "convolution2d_5", "subsample": [2, 2], "activation": "linear", "b_constraint": null, "trainable": true, "nb_filter": 64, "W_constraint": null, "init": "glorot_uniform", "nb_col": 3, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 1000, "name": "dense_1", "input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 100, "name": "dense_2", "input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 50, "name": "dense_3", "input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 10, "name": "dense_4", "input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 1, "name": "dense_5", "input_dim": null, "b_constraint": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear"}}], "keras_version": "1.1.2"}