{"config": [{"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_1", "border_mode": "valid", "bias": true, "nb_filter": 24, "input_dtype": "float32", "nb_col": 5, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_2", "bias": true, "nb_filter": 36, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "activation": "linear", "trainable": true, "border_mode": "valid", "nb_col": 5, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_3", "bias": true, "nb_filter": 48, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "nb_row": 3, "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "activation": "linear", "trainable": true, "border_mode": "valid", "nb_col": 3, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_4", "bias": true, "nb_filter": 64, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "nb_row": 3, "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "activation": "linear", "trainable": true, "border_mode": "valid", "nb_col": 3, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "dim_ordering": "tf", "name": "convolution2d_5", "bias": true, "nb_filter": 64, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "nb_row": 3, "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "activation": "linear", "trainable": true, "border_mode": "valid", "nb_col": 3, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "input_dim": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activation": "linear", "b_constraint": null, "output_dim": 1000}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "input_dim": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activation": "linear", "b_constraint": null, "output_dim": 500}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_3", "input_dim": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activation": "linear", "b_constraint": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_4", "input_dim": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activation": "linear", "b_constraint": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_5", "input_dim": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "activation": "linear", "b_constraint": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_6", "input_dim": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}