{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "border_mode": "valid", "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "activity_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "name": "convolution2d_1", "nb_row": 5, "W_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "border_mode": "valid", "nb_filter": 36, "b_constraint": null, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "border_mode": "valid", "nb_filter": 48, "b_constraint": null, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "bias": true, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 1000, "b_regularizer": null, "name": "dense_1", "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 500, "b_regularizer": null, "name": "dense_2", "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "name": "dense_3", "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "name": "dense_4", "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "name": "dense_5", "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_10"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "W_constraint": null, "input_dim": null, "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "name": "dense_6", "trainable": true, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}