{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_221", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 160, 320, 3], "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_221"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_222", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_222"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_223", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_223"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_224", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_224"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_225", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_225"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_45"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_177", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 3072, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 100}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_178", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_179", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 10}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_180", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "output_dim": 1}}]}