{"config": [{"config": {"nb_filter": 24, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_col": 5, "bias": true, "activity_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "input_dtype": "float32", "dim_ordering": "tf", "nb_row": 5, "W_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_filter": 36, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_col": 5, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "dim_ordering": "tf", "nb_row": 5, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_filter": 48, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_col": 3, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "dim_ordering": "tf", "nb_row": 3, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_filter": 64, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_col": 3, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "dim_ordering": "tf", "nb_row": 3, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_filter": 64, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_col": 3, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "dim_ordering": "tf", "nb_row": 3, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "input_dim": null, "b_constraint": null, "output_dim": 1000}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "input_dim": null, "b_constraint": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "input_dim": null, "b_constraint": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "input_dim": null, "b_constraint": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "name": "dense_5", "W_regularizer": null, "input_dim": null, "b_constraint": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}