{"keras_version": "1.1.2", "config": [{"config": {"nb_row": 5, "dim_ordering": "tf", "nb_filter": 24, "init": "glorot_uniform", "input_dtype": "float32", "nb_col": 5, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "batch_input_shape": [null, 160, 320, 3], "b_constraint": null, "border_mode": "valid", "name": "convolution2d_1", "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "dim_ordering": "tf", "nb_filter": 36, "init": "glorot_uniform", "nb_col": 5, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "dim_ordering": "tf", "nb_filter": 48, "init": "glorot_uniform", "nb_col": 5, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_3", "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_4", "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_5", "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "output_dim": 100, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "output_dim": 50, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "output_dim": 10, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}