{"config": [{"config": {"border_mode": "valid", "b_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 160, 320, 3], "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "nb_filter": 24, "dim_ordering": "tf", "b_constraint": null, "input_dtype": "float32", "W_constraint": null, "W_regularizer": null, "activation": "linear", "nb_col": 5, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "nb_filter": 36, "bias": true, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 5, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "nb_filter": 48, "bias": true, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 5, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "bias": true, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "relu", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"output_dim": 50, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "relu", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"output_dim": 10, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "name": "dense_3"}, "class_name": "Dense"}, {"config": {"output_dim": 1, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "name": "dense_4"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}