{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "activation": "linear", "W_regularizer": null, "bias": true, "nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "b_regularizer": null, "W_constraint": null, "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "border_mode": "valid", "name": "convolution2d_2", "activation": "linear", "bias": true, "nb_col": 5, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "border_mode": "valid", "name": "convolution2d_3", "activation": "linear", "bias": true, "nb_col": 5, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 48, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "border_mode": "valid", "name": "convolution2d_4", "activation": "linear", "bias": true, "nb_col": 3, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "border_mode": "valid", "name": "convolution2d_5", "activation": "linear", "bias": true, "nb_col": 3, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "trainable": true, "input_dim": null, "name": "dense_1", "activation": "linear", "bias": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_constraint": null, "trainable": true, "input_dim": null, "name": "dense_2", "activation": "linear", "bias": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_constraint": null, "trainable": true, "input_dim": null, "name": "dense_3", "activation": "linear", "bias": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "trainable": true, "input_dim": null, "name": "dense_4", "activation": "linear", "bias": true, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}]}