{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "b_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "bias": true, "batch_input_shape": [null, 160, 320, 3], "nb_filter": 24, "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "bias": true, "name": "convolution2d_2", "activation": "linear", "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "bias": true, "name": "convolution2d_3", "activation": "linear", "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "bias": true, "name": "convolution2d_4", "activation": "linear", "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "trainable": true, "bias": true, "name": "convolution2d_5", "activation": "linear", "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "name": "dense_1", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 100, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "name": "dense_2", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 50, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "name": "dense_3", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 10, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "name": "dense_4", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 1, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}}]}