{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 160, 320, 3], "trainable": true, "init": "glorot_uniform", "nb_row": 5, "name": "convolution2d_1", "W_constraint": null, "input_dtype": "float32", "subsample": [2, 2], "b_regularizer": null, "nb_filter": 24, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "bias": true, "nb_col": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "name": "convolution2d_2", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 36, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_col": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_3", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 48, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_col": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_row": 3, "name": "convolution2d_4", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_col": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 100, "input_dim": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 50, "input_dim": null, "activation": "linear", "b_constraint": null, "name": "dense_2", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 10, "input_dim": null, "activation": "linear", "b_constraint": null, "name": "dense_3", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "bias": true}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "output_dim": 1, "input_dim": null, "activation": "linear", "b_constraint": null, "name": "dense_4", "W_regularizer": null, "bias": true}}]}