{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_col": 5, "batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "nb_filter": 24, "name": "convolution2d_1", "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "W_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_filter": 36, "name": "convolution2d_2", "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_filter": 48, "name": "convolution2d_3", "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_filter": 64, "name": "convolution2d_4", "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_filter": 64, "name": "convolution2d_5", "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "output_dim": 1000}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "input_dim": null, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "output_dim": 500}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "input_dim": null, "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "output_dim": 100}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "input_dim": null, "name": "dense_4", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "output_dim": 50}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "activation": "linear", "bias": true, "input_dim": null, "name": "dense_5", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "output_dim": 10}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "input_dim": null, "name": "dense_6", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "output_dim": 1}}], "keras_version": "1.1.2"}