{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "name": "convolution2d_1", "bias": true, "activation": "linear", "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "trainable": true, "nb_col": 5, "nb_filter": 24, "dim_ordering": "tf", "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "nb_col": 5, "nb_filter": 36, "nb_row": 5, "subsample": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 48, "nb_row": 3, "subsample": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 64, "nb_row": 3, "subsample": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_5", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "nb_col": 3, "nb_filter": 64, "nb_row": 3, "subsample": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 1000, "trainable": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 100, "trainable": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_3", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 50, "trainable": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_4", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 10, "trainable": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "name": "dense_5", "b_constraint": null, "activation": "linear", "activity_regularizer": null, "output_dim": 1, "trainable": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "bias": true}}]}