{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_col": 5, "input_dtype": "float32", "activation": "linear", "nb_filter": 24, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "batch_input_shape": [null, 160, 320, 3], "b_constraint": null, "W_regularizer": null, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activation": "linear", "nb_filter": 36, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "b_constraint": null, "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_col": 3, "W_regularizer": null, "activation": "linear", "nb_filter": 48, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 3, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "b_constraint": null, "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_col": 3, "W_regularizer": null, "activation": "linear", "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "init": "glorot_uniform", "nb_row": 3, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "b_constraint": null, "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "activation": "linear", "output_dim": 100, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "activation": "linear", "output_dim": 50, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "activation": "linear", "output_dim": 10, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_3", "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "activation": "linear", "output_dim": 1, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_4", "bias": true, "b_constraint": null}}]}